#-*- coding: utf-8 -*-


#=============================================================================
# 公众号类型
#=============================================================================
# 订阅号
WECHAT_TYPE_SUB = 0
# 升级后的订阅号
WECHAT_TYPE_SUB2 = 1
# 服务号
WECHAT_TYPE_SERVICE = 2


#=============================================================================
# 开放平台授权方认证类型
#=============================================================================
VERIFY_TYPE_NONE = -1
VERIFY_TYPE_WECHAT = 0
VERIFY_TYPE_WEIBO = 1
VERIFY_TYPE_TENCENT_WEIBO = 2
# 已资质认证通过但还未通过名称认证
VERIFY_TYPE_BASE_VERIFY = 3
# 已资质认证通过、还未通过名称认证，但通过了新浪微博认证
VERIFY_TYPE_3_1 = 4
# 已资质认证通过、还未通过名称认证，但通过了腾讯微博认证
VERIFY_TYPE_3_2 = 5
